In [163]:
#Importing the pandas library for data manipulation and analysis
import pandas as pd

In [166]:
# Creating project DataFrame
project_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005', 'A002', 'A005', 'A003', 'A001', 'A003', 'A001', 'A004', 'A004', 'A005'],
    'Project': ['Project 1', 'Project 2', 'Project 3', 'Project 4', 'Project 5', 'Project 6', 'Project 7', 'Project 8', 'Project 9', 'Project 10', 'Project 11', 'Project 12', 'Project 13', 'Project 14'],
    'Cost': [1002000, 2000000, 4500000, 5500000, None, 680000, 400000, 350000, None, 300000, 2000000, 1000000, 3000000, 200000],
    'Status': ['Finished', 'Ongoing', 'Finished', 'Ongoing', 'Finished', 'Failed', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Failed', 'Ongoing', 'Finished', 'Finished']
}
# Convert the raw project_data dictionary into a Pandas DataFrame
project_df = pd.DataFrame(project_data)
# Printing a confirmation message so that DataFrame was created
print("Project DataFrame created")
# Display the DataFrame in the output
project_df

Project DataFrame created

      ID     Project      Cost    Status
0   A001   Project 1 1002000.0  Finished
1   A002   Project 2 2000000.0   Ongoing
2   A003   Project 3 4500000.0  Finished
3   A004   Project 4 5500000.0   Ongoing
4   A005   Project 5       NaN  Finished
5   A002   Project 6  680000.0    Failed
6   A005   Project 7  400000.0  Finished
7   A003   Project 8  350000.0    Failed
8   A001   Project 9       NaN   Ongoing
9   A003  Project 10  300000.0  Finished
10  A001  Project 11 2000000.0    Failed
11  A004  Project 12 1000000.0   Ongoing
12  A004  Project 13 3000000.0  Finished
13  A005  Project 14  200000.0  Finished

In [167]:
# Save Project DataFrame to CSV
project_df.to_csv('project_dataframe.csv', index=False)
print("Project DataFrame saved to project_dataframe.csv")

Project DataFrame saved to project_dataframe.csv

In [168]:
# Create Employee DataFrame
employee_data = {
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],
    'Name': ['John Alter', 'Alice Luxumberg', 'Tom Sabestine', 'Nina Adgra', 'Amy Johny'],
    'Gender': ['M', 'F', 'M', 'F', 'F'],
    'City': ['Paris', 'London', 'Berlin', 'Newyork', 'Madrid'],
    'Age': [25, 27, 29, 31, 30]
}
# Convert the raw employee_data dictionary into a Pandas DataFrame
employee_df = pd.DataFrame(employee_data)
# Printing a confirmation message so that DataFrame was created
print("Employee DataFrame created")
# Display the DataFrame in the output
employee_df

Employee DataFrame created

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [165]:
# Save Employee DataFrame to CSV
employee_df.to_csv('employee_dataframe.csv', index=False)
print("Employee DataFrame saved to employee_dataframe.csv")

Employee DataFrame saved to employee_dataframe.csv

In [172]:
seniority_data = {
    'ID': ['A001','A002','A003','A004','A005'],
    'Designation Level': [2, 2, 3, 2, 3]
}
# Convert the raw seniority_data dictionary into a Pandas DataFrame
seniority_df = pd.DataFrame(seniority_data)
# Printing a confirmation message so that DataFrame was created
print("seniority DataFrame created")
# Display the DataFrame in the output
seniority_df

seniority DataFrame created

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [173]:
# Save seniority DataFrame to CSV
seniority_df.to_csv('seniority.csv', index=False)
print("seniority DataFrame saved to seniority_data.csv")

seniority DataFrame saved to seniority_data.csv

In [174]:
# Import the pandas library for data manipulation and analysis
import pandas as pd
# Import the NumPy library for numerical operations and array handling
import numpy as np

In [175]:
# Print the task label to indicate which task is being executed
print("Task 2")
# Display the entire project_df DataFrame 
print(project_df)
# Label to indicate missing values in Cost
print("Missing values in Cost column")
# Count how many missing NaN values are in the 'Cost' column and print the result
print(project_df['Cost'].isnull().sum())

Task 2
      ID     Project      Cost    Status
0   A001   Project 1 1002000.0  Finished
1   A002   Project 2 2000000.0   Ongoing
2   A003   Project 3 4500000.0  Finished
3   A004   Project 4 5500000.0   Ongoing
4   A005   Project 5       NaN  Finished
5   A002   Project 6  680000.0    Failed
6   A005   Project 7  400000.0  Finished
7   A003   Project 8  350000.0    Failed
8   A001   Project 9       NaN   Ongoing
9   A003  Project 10  300000.0  Finished
10  A001  Project 11 2000000.0    Failed
11  A004  Project 12 1000000.0   Ongoing
12  A004  Project 13 3000000.0  Finished
13  A005  Project 14  200000.0  Finished
Missing values in Cost column
2

In [176]:
# Create a copy of project_df to avoid modifying the original DataFrame
project_df_updated = project_df.copy()

In [177]:
# Display a message indicating  we are handling missing values using a for loop
print("Working on the missing value using for loop")

Working on the missing value using for loop

In [178]:
# Convert the Cost column to float type to work on numeric operations 
project_df_updated['Cost'] = project_df_updated['Cost'].astype(float)

In [179]:
# Initialize variables for sum and count of valid cost values
running_sum = 0  
count = 0

In [180]:
#Loop through the rows using a 'for' loop
for i in range(len(project_df_updated)):
    # Check if the cost is missing (NaN) where i is row and 'Cost' is column
    if pd.isna(project_df_updated.loc[i,'Cost']):
        # Only calculate average if we have at least one valid cost
         if count > 0:
             average = running_sum / count
             # Replace the missing value with the running average
             project_df_updated.loc[i,'Cost'] = average
    else:
         # If the cost is valid, add it to the running sum and increase count
        running_sum += project_df_updated.loc[i,'Cost']
          # Increment the count of valid cost entries
        count += 1
# Save the updated DataFrame to CSV, formatting floats to 1 decimal place
project_df_updated.to_csv("project_filled.csv", index=False, float_format='%.1f')
# Set Pandas display option to show floats with 1 decimal place in output
pd.set_option('display.float_format', '{:.1f}'.format)
# Print the updated DataFrame to verify the changes
print(project_df_updated)

      ID     Project      Cost    Status
0   A001   Project 1 1002000.0  Finished
1   A002   Project 2 2000000.0   Ongoing
2   A003   Project 3 4500000.0  Finished
3   A004   Project 4 5500000.0   Ongoing
4   A005   Project 5 3250500.0  Finished
5   A002   Project 6  680000.0    Failed
6   A005   Project 7  400000.0  Finished
7   A003   Project 8  350000.0    Failed
8   A001   Project 9 2061714.3   Ongoing
9   A003  Project 10  300000.0  Finished
10  A001  Project 11 2000000.0    Failed
11  A004  Project 12 1000000.0   Ongoing
12  A004  Project 13 3000000.0  Finished
13  A005  Project 14  200000.0  Finished

In [181]:
# Prints output below belongs to Task 3
print("Task3")
# Creates a DataFrame employee_df from the dictionary named employee_data
employee_df = pd.DataFrame(employee_data)
# Displays the employee_df DataFrame in the console so you can see its contents
print(employee_df)

Task3
     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [91]:
# Split the Name column
employee_df[['FirstName','LastName']] = employee_df['Name'].str.split(' ',n=1,expand = True)
# Drop the old Name column
employee_df = employee_df.drop('Name',axis=1)
# Display the result
print(employee_df)

     ID Gender     City  Age FirstName   LastName
0  A001      M    Paris   25      John      Alter
1  A002      F   London   27     Alice  Luxumberg
2  A003      M   Berlin   29       Tom  Sabestine
3  A004      F  Newyork   31      Nina      Adgra
4  A005      F   Madrid   30       Amy      Johny

In [182]:
# Prints output below belongs to Task 4
print("task 4")

task 4

In [183]:
# Convert the raw project_data dictionary into a DataFrame
project_df = pd.DataFrame(project_data)
# Convert the raw employee_data dictionary into a DataFrame
employee_df = pd.DataFrame(employee_data)
# Convert the raw seniority_data dictionary into a DataFrame
seniority_df = pd.DataFrame(seniority_data)

In [184]:
# Split the 'Name' column into 'FirstName' and 'LastName', n=1 ensures we only split on the first space.
#expand=True returns the result as separate DataFrame columns
employee_df[['FirstName','LastName']] = employee_df['Name'].str.split(' ', n=1, expand=True)
employee_df.drop(columns=['Name'], inplace=True)
# Merge Employee and Seniority first (on 'ID')
senior_employee_df = pd.merge(employee_df,seniority_df, on = 'ID', how = 'left')

In [185]:
# Merge the above result with Project data
final_df = pd.merge(senior_employee_df,project_df, on = 'ID', how = 'left')

In [186]:
print(final_df)

      ID Gender     City  Age FirstName   LastName  Designation Level  \
0   A001      M    Paris   25      John      Alter                  2
1   A001      M    Paris   25      John      Alter                  2
2   A001      M    Paris   25      John      Alter                  2
3   A002      F   London   27     Alice  Luxumberg                  2
4   A002      F   London   27     Alice  Luxumberg                  2
5   A003      M   Berlin   29       Tom  Sabestine                  3
6   A003      M   Berlin   29       Tom  Sabestine                  3
7   A003      M   Berlin   29       Tom  Sabestine                  3
8   A004      F  Newyork   31      Nina      Adgra                  2
9   A004      F  Newyork   31      Nina      Adgra                  2
10  A004      F  Newyork   31      Nina      Adgra                  2
11  A005      F   Madrid   30       Amy      Johny                  3
12  A005      F   Madrid   30       Amy      Johny                  3
13  A005      F   Madrid   30       Amy      Johny                  3

       Project      Cost    Status
0    Project 1 1002000.0  Finished
1    Project 9       NaN   Ongoing
2   Project 11 2000000.0    Failed
3    Project 2 2000000.0   Ongoing
4    Project 6  680000.0    Failed
5    Project 3 4500000.0  Finished
6    Project 8  350000.0    Failed
7   Project 10  300000.0  Finished
8    Project 4 5500000.0   Ongoing
9   Project 12 1000000.0   Ongoing
10  Project 13 3000000.0  Finished
11   Project 5       NaN  Finished
12   Project 7  400000.0  Finished
13  Project 14  200000.0  Finished

In [203]:
# Prints output below belongs to Task 5
print("task 5")

task 5

In [142]:
#using np.where condition to solve the bonous
final_df["Bonus"] = np.where(final_df['Status'] == 'Finished', final_df['Cost'] * 0.05, 0)
print(final_df)

      ID Gender     City  Age FirstName   LastName  Designation Level  \
0   A001      M    Paris   25      John      Alter                  2
1   A001      M    Paris   25      John      Alter                  2
2   A001      M    Paris   25      John      Alter                  2
3   A002      F   London   27     Alice  Luxumberg                  2
4   A002      F   London   27     Alice  Luxumberg                  2
5   A003      M   Berlin   29       Tom  Sabestine                  3
6   A003      M   Berlin   29       Tom  Sabestine                  3
7   A003      M   Berlin   29       Tom  Sabestine                  3
8   A004      F  Newyork   31      Nina      Adgra                  2
9   A004      F  Newyork   31      Nina      Adgra                  2
10  A004      F  Newyork   31      Nina      Adgra                  2
11  A005      F   Madrid   30       Amy      Johny                  3
12  A005      F   Madrid   30       Amy      Johny                  3
13  A005      F   Madrid   30       Amy      Johny                  3

       Project      Cost    Status    Bonus
0    Project 1 1002000.0  Finished  50100.0
1    Project 9       NaN   Ongoing      0.0
2   Project 11 2000000.0    Failed      0.0
3    Project 2 2000000.0   Ongoing      0.0
4    Project 6  680000.0    Failed      0.0
5    Project 3 4500000.0  Finished 225000.0
6    Project 8  350000.0    Failed      0.0
7   Project 10  300000.0  Finished  15000.0
8    Project 4 5500000.0   Ongoing      0.0
9   Project 12 1000000.0   Ongoing      0.0
10  Project 13 3000000.0  Finished 150000.0
11   Project 5       NaN  Finished      NaN
12   Project 7  400000.0  Finished  20000.0
13  Project 14  200000.0  Finished  10000.0

In [187]:
# Prints output below belongs to Task 6
print("task 6")

task 6

In [188]:
#Demote designation level for those employees
final_df.loc[final_df['Status']=='Failed','Designation Level'] -= 1
#Identify and delete employees with a designation level > 4
final_df = final_df[final_df['Designation Level'] <= 4]
# Reset the index of final_df to a clean 0..n range and drop the old index column
final_df.reset_index(drop = True, inplace = True)
# Display the updated DataFrame
print(final_df)

      ID Gender     City  Age FirstName   LastName  Designation Level  \
0   A001      M    Paris   25      John      Alter                  2
1   A001      M    Paris   25      John      Alter                  2
2   A001      M    Paris   25      John      Alter                  1
3   A002      F   London   27     Alice  Luxumberg                  2
4   A002      F   London   27     Alice  Luxumberg                  1
5   A003      M   Berlin   29       Tom  Sabestine                  3
6   A003      M   Berlin   29       Tom  Sabestine                  2
7   A003      M   Berlin   29       Tom  Sabestine                  3
8   A004      F  Newyork   31      Nina      Adgra                  2
9   A004      F  Newyork   31      Nina      Adgra                  2
10  A004      F  Newyork   31      Nina      Adgra                  2
11  A005      F   Madrid   30       Amy      Johny                  3
12  A005      F   Madrid   30       Amy      Johny                  3
13  A005      F   Madrid   30       Amy      Johny                  3

       Project      Cost    Status
0    Project 1 1002000.0  Finished
1    Project 9       NaN   Ongoing
2   Project 11 2000000.0    Failed
3    Project 2 2000000.0   Ongoing
4    Project 6  680000.0    Failed
5    Project 3 4500000.0  Finished
6    Project 8  350000.0    Failed
7   Project 10  300000.0  Finished
8    Project 4 5500000.0   Ongoing
9   Project 12 1000000.0   Ongoing
10  Project 13 3000000.0  Finished
11   Project 5       NaN  Finished
12   Project 7  400000.0  Finished
13  Project 14  200000.0  Finished

In [190]:
# Prints output below belongs to Task 7
print("task7")

task7

In [205]:
# Add "Mr." or "Mrs." prefix to FirstName based on Gender, 
# but only if the name doesn't already start with that prefix
final_df['FirstName'] = final_df.apply(
    lambda row: row['FirstName'] 
    if row['FirstName'].startswith(('Mr. ', 'Mrs. ')) 
    else ("Mr. " + row['FirstName'] if row['Gender'] == 'M' else "Mrs. " + row['FirstName']),
    axis=1
)
# Remove the 'Gender' column from final_df as it's no longer needed
final_df.drop(columns=['Gender'], inplace=True)

In [207]:
# Prints the final output
print(final_df)

      ID     City  Age   FirstName   LastName  Designation Level     Project  \
0   A001    Paris   25    Mr. John      Alter                  2   Project 1
1   A001    Paris   25    Mr. John      Alter                  2   Project 9
2   A001    Paris   25    Mr. John      Alter                  1  Project 11
3   A002   London   27  Mrs. Alice  Luxumberg                  2   Project 2
4   A002   London   27  Mrs. Alice  Luxumberg                  1   Project 6
5   A003   Berlin   29     Mr. Tom  Sabestine                  3   Project 3
6   A003   Berlin   29     Mr. Tom  Sabestine                  2   Project 8
7   A003   Berlin   29     Mr. Tom  Sabestine                  3  Project 10
8   A004  Newyork   31   Mrs. Nina      Adgra                  3   Project 4
9   A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 12
10  A004  Newyork   31   Mrs. Nina      Adgra                  3  Project 13
11  A005   Madrid   30    Mrs. Amy      Johny                  4   Project 5
12  A005   Madrid   30    Mrs. Amy      Johny                  4   Project 7
13  A005   Madrid   30    Mrs. Amy      Johny                  4  Project 14

        Cost    Status
0  1002000.0  Finished
1        NaN   Ongoing
2  2000000.0    Failed
3  2000000.0   Ongoing
4   680000.0    Failed
5  4500000.0  Finished
6   350000.0    Failed
7   300000.0  Finished
8  5500000.0   Ongoing
9  1000000.0   Ongoing
10 3000000.0  Finished
11       NaN  Finished
12  400000.0  Finished
13  200000.0  Finished

In [192]:
# Prints output below belongs to Task 8
print("task 8")

task 8

In [193]:
# Promote level by 1 for employees older than 29
final_df.loc[final_df['Age'] > 29, 'Designation Level'] = final_df['Designation Level'] + 1

In [194]:
# Display the final merged and processed DataFrame
print(final_df)

      ID Gender     City  Age   FirstName   LastName  Designation Level  \
0   A001      M    Paris   25    Mr. John      Alter                  2
1   A001      M    Paris   25    Mr. John      Alter                  2
2   A001      M    Paris   25    Mr. John      Alter                  1
3   A002      F   London   27  Mrs. Alice  Luxumberg                  2
4   A002      F   London   27  Mrs. Alice  Luxumberg                  1
5   A003      M   Berlin   29     Mr. Tom  Sabestine                  3
6   A003      M   Berlin   29     Mr. Tom  Sabestine                  2
7   A003      M   Berlin   29     Mr. Tom  Sabestine                  3
8   A004      F  Newyork   31   Mrs. Nina      Adgra                  3
9   A004      F  Newyork   31   Mrs. Nina      Adgra                  3
10  A004      F  Newyork   31   Mrs. Nina      Adgra                  3
11  A005      F   Madrid   30    Mrs. Amy      Johny                  4
12  A005      F   Madrid   30    Mrs. Amy      Johny                  4
13  A005      F   Madrid   30    Mrs. Amy      Johny                  4

       Project      Cost    Status
0    Project 1 1002000.0  Finished
1    Project 9       NaN   Ongoing
2   Project 11 2000000.0    Failed
3    Project 2 2000000.0   Ongoing
4    Project 6  680000.0    Failed
5    Project 3 4500000.0  Finished
6    Project 8  350000.0    Failed
7   Project 10  300000.0  Finished
8    Project 4 5500000.0   Ongoing
9   Project 12 1000000.0   Ongoing
10  Project 13 3000000.0  Finished
11   Project 5       NaN  Finished
12   Project 7  400000.0  Finished
13  Project 14  200000.0  Finished

In [195]:
# Prints output below belongs to Task 9
print("task 9")

task 9

In [196]:
# Ensure Cost is numeric
final_df['Cost'] = pd.to_numeric(final_df['Cost'], errors='coerce')

In [197]:
# Group by ID and FirstName, summing the Cost
TotalProjCost = final_df.groupby(['ID', 'FirstName'], as_index=False)['Cost'].sum()

In [198]:
# Rename the column to match requirement
TotalProjCost.rename(columns={'Cost': 'Total cost'}, inplace=True)

In [199]:
# Display the final merged and processed DataFrame
print(TotalProjCost)

     ID   FirstName  Total cost
0  A001    Mr. John   3002000.0
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy    600000.0

In [200]:
# Prints output below belongs to Task 10
print("task 10")

task 10

In [201]:
# Select all rows where the 'City' column contains the letter "o" & ignore NaN values to prevent errors
employees_with_o = final_df[final_df['City'].str.contains('o', case=False, na=False)]

In [202]:
# Display the final DataFrame
print(employees_with_o)

      ID Gender     City  Age   FirstName   LastName  Designation Level  \
3   A002      F   London   27  Mrs. Alice  Luxumberg                  2
4   A002      F   London   27  Mrs. Alice  Luxumberg                  1
8   A004      F  Newyork   31   Mrs. Nina      Adgra                  3
9   A004      F  Newyork   31   Mrs. Nina      Adgra                  3
10  A004      F  Newyork   31   Mrs. Nina      Adgra                  3

       Project      Cost    Status
3    Project 2 2000000.0   Ongoing
4    Project 6  680000.0    Failed
8    Project 4 5500000.0   Ongoing
9   Project 12 1000000.0   Ongoing
10  Project 13 3000000.0  Finished